alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
<?xml version='1.0' encoding='utf-8' standalone='no'?>
<device schemaVersion="1.1"
    xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
    <vendor>Milandr</vendor>
    <vendorID>Milandr</vendorID>
    <name>MDR1206AFI</name>
    <version>2.0</version>
    <description>MDR1206AFI</description>
    <addressUnitBits>8</addressUnitBits>
    <width>32</width>
    <size>32</size>
    <access>read-write</access>
    <resetValue>0x00000000</resetValue>
    <resetMask>0xFFFFFFFF</resetMask>
    <cpu>
        <name>BM-310S0</name>
        <endian>little</endian>
    </cpu>
    <peripherals>
        <peripheral>
            <name>CLINT</name>
            <description>Core Local Interruptor</description>
            <groupName>CLINT</groupName>
            <baseAddress>0x02000000</baseAddress>
            <addressBlock>
                <offset>0x00000000</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x00004000</offset>
                <size>0x8</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x0000BFF8</offset>
                <size>0x8</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTMSIP</name>
                    <displayName>CTMSIP</displayName>
                    <description>Software Interrupt Request/Clear Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x00000001</resetMask>
                    <fields>
                        <field>
                            <name>msip</name>
                            <description>Waiting for software interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTMTIMECMP</name>
                    <displayName>CTMTIMECMP</displayName>
                    <description>Machine Timer Comparison Register</description>
                    <addressOffset>0x00004000</addressOffset>
                    <size>64</size>
                    <access>read-write</access>
                    <resetValue>0x0000000000000000</resetValue>
                    <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>mtimecmp_lo</name>
                            <description>Lower part of the value of the comparison register</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>mtimecmp_hi</name>
                            <description>Higher part of the value of the comparison register</description>
                            <bitOffset>32</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTMTIME</name>
                    <displayName>CTMTIME</displayName>
                    <description>Machine Timer Value Register</description>
                    <addressOffset>0x0000BFF8</addressOffset>
                    <size>64</size>
                    <access>read-write</access>
                    <resetValue>0x0000000000000000</resetValue>
                    <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>mtime_lo</name>
                            <description>Lower part of the timer value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>mtime_hi</name>
                            <description>Higher part of the timer value</description>
                            <bitOffset>32</bitOffset>
                            <bitWidth>32</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>CLIC</name>
            <description>Core Local Interrupt Controller</description>
            <groupName>CLIC</groupName>
            <baseAddress>0x0D000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00008000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CLICCFG</name>
                    <displayName>CLICCFG</displayName>
                    <description>CLIC Configuration Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x8</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>NVBITS</name>
                            <description>Function of Nested Vectored Interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NVI_function</name>
                                    <description>NVI is available</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>No_NVI_function</name>
                                    <description>NVI isn't available</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NLBITS</name>
                            <description>The number of higher-order bits in clicintctl[i] used to set interrupt level</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>NMBITS</name>
                            <description>The number of bits in clicintattr[i].mode to set prior entrance for i</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLICINFO</name>
                    <displayName>CLICINFO</displayName>
                    <description>CLIC Information Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>NUM_INTERRUPT</name>
                            <description>The maximum number of interrupt input signals</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>13</bitWidth>
                        </field>
                        <field>
                            <name>VERSION</name>
                            <description>CLIC version</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>CLICINTCTLBITS</name>
                            <description>The number of bits in clicintctl[i]</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>NUM_TRIGGER</name>
                            <description>The maximun number of interrupt triggers</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>6</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLICINT_0</name>
                    <displayName>CLICINT[0]_USIP</displayName>
                    <description>Software interrupt for user priority mode</description>
                    <addressOffset>0x00001000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CLICINTIP_IP</name>
                            <description>Interrupt pending</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IP_ON</name>
                                    <description>Interrupt pending is on</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Int_OFF</name>
                                    <description>Interrupt pending is off</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLICINTIE_IE</name>
                            <description>Interrupt enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Int_ON</name>
                                    <description>Interrupt is on</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Int_OFF</name>
                                    <description>Interrupt is off</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLICINTATTR_SHV</name>
                            <description>Selection of the vectored interrup</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>VEC</name>
                                    <description>Vectored interrupt</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NON_VEC</name>
                                    <description>Non-vectored interrupt</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLICINTATTR_TRIG</name>
                            <description>Trigger type and polarity for every interrupt</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>HIGH_LEV</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>POS_EDGE</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>LOW_LEV</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEG_EDGE</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLICINTATTR_MODE</name>
                            <description>Mode of the privileged interrupt</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>U_MODE</name>
                                    <description>User</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>M_MODE</name>
                                    <description>Machine</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CLICINTCTL_LEVEL_PRIORITY</name>
                            <description>Interrupt level and priority</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_1</name>
                    <displayName>CLICINT[1]</displayName>
                    <description>CLICINT[1] description</description>
                    <addressOffset>0x00001004</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_2</name>
                    <displayName>CLICINT[2]</displayName>
                    <description>CLICINT[2] description</description>
                    <addressOffset>0x00001008</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_3</name>
                    <displayName>CLICINT[3]_MSIP</displayName>
                    <description>CLICINT[3]_MSIP description</description>
                    <addressOffset>0x0000100C</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_4</name>
                    <displayName>CLICINT[4]_UTIP</displayName>
                    <description>CLICINT[4]_UTIP description</description>
                    <addressOffset>0x00001010</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_5</name>
                    <displayName>CLICINT[5]</displayName>
                    <description>CLICINT[5] description</description>
                    <addressOffset>0x00001014</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_6</name>
                    <displayName>CLICINT[6]</displayName>
                    <description>CLICINT[6] description</description>
                    <addressOffset>0x00001018</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_7</name>
                    <displayName>CLICINT[7]_MTIP</displayName>
                    <description>CLICINT[7]_MTIP description</description>
                    <addressOffset>0x0000101C</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_8</name>
                    <displayName>CLICINT[8]</displayName>
                    <description>CLICINT[8] description</description>
                    <addressOffset>0x00001020</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_9</name>
                    <displayName>CLICINT[9]</displayName>
                    <description>CLICINT[9] description</description>
                    <addressOffset>0x00001024</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_10</name>
                    <displayName>CLICINT[10]</displayName>
                    <description>CLICINT[10] description</description>
                    <addressOffset>0x00001028</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_11</name>
                    <displayName>CLICINT[11]</displayName>
                    <description>CLICINT[11] description</description>
                    <addressOffset>0x0000102C</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_12</name>
                    <displayName>CLICINT[12]_CSIP</displayName>
                    <description>CLICINT[12]_CSIP description</description>
                    <addressOffset>0x00001030</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_13</name>
                    <displayName>CLICINT[13]</displayName>
                    <description>CLICINT[13] description</description>
                    <addressOffset>0x00001034</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_14</name>
                    <displayName>CLICINT[14]</displayName>
                    <description>CLICINT[14] description</description>
                    <addressOffset>0x00001038</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_15</name>
                    <displayName>CLICINT[15]</displayName>
                    <description>CLICINT[15] description</description>
                    <addressOffset>0x0000103C</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_16</name>
                    <displayName>CLICINT[16]_DMA</displayName>
                    <description>CLICINT[16]_DMA description</description>
                    <addressOffset>0x00001040</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_17</name>
                    <displayName>CLICINT[17]_UART1</displayName>
                    <description>CLICINT[17]_UART1 description</description>
                    <addressOffset>0x00001044</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_18</name>
                    <displayName>CLICINT[18]_UART2</displayName>
                    <description>CLICINT[18]_UART2 description</description>
                    <addressOffset>0x00001048</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_19</name>
                    <displayName>CLICINT[19]_SSP1</displayName>
                    <description>CLICINT[19]_SSP1 description</description>
                    <addressOffset>0x0000104C</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_20</name>
                    <displayName>CLICINT[20]_POWER</displayName>
                    <description>CLICINT[20]_POWER description</description>
                    <addressOffset>0x00001050</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_21</name>
                    <displayName>CLICINT[21]_WWDG</displayName>
                    <description>CLICINT[21]_WWDG description</description>
                    <addressOffset>0x00001054</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_22</name>
                    <displayName>CLICINT[22]_TIMER1</displayName>
                    <description>CLICINT[22]_TIMER1 description</description>
                    <addressOffset>0x00001058</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_23</name>
                    <displayName>CLICINT[23]_TIMER2</displayName>
                    <description>CLICINT[23]_TIMER2 description</description>
                    <addressOffset>0x0000105C</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_24</name>
                    <displayName>CLICINT[24]_ADC</displayName>
                    <description>CLICINT[24]_ADC description</description>
                    <addressOffset>0x00001060</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_25</name>
                    <displayName>CLICINT[25]_I2C</displayName>
                    <description>CLICINT[25]_I2C description</description>
                    <addressOffset>0x00001064</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_26</name>
                    <displayName>CLICINT[26]_BKP</displayName>
                    <description>CLICINT[26]_BKP description</description>
                    <addressOffset>0x00001068</addressOffset>
                </register>
                <register derivedFrom="CLICINT_0">
                    <name>CLICINT_27</name>
                    <displayName>CLICINT[27]_EXT_INT1</displayName>
                    <description>CLICINT[27]_EXT_INT1 description</description>
                    <addressOffset>0x0000106C</addressOffset>
                </register>
