alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SSP1</name>
            <description>SSP1 Interface</description>
            <groupName>SSP</groupName>
            <baseAddress>0x50000000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SSP1_IRQ</name>
                <value>3</value>
            </interrupt>
            <registers>
                <register>
                    <name>CR0</name>
                    <displayName>CR0</displayName>
                    <description>Control Register 0</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DSS_LOW</name>
                            <description>Data size select, low-order bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>FRF</name>
                            <description>Frame format</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SPO</name>
                            <description>SSPCLKOUT polarity</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPH</name>
                            <description>SSPCLKOUT phase</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SCR</name>
                            <description>Serial clock rate</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DSS_HIGH</name>
                            <description>Data size select, high-order bit</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSPFRX</name>
                            <description>SSPFRX description</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CR1</name>
                    <displayName>CR1</displayName>
                    <description>Control Register 1</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>LBM</name>
                            <description>Loop back mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSE</name>
                            <description>Synchronous serial port enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MS</name>
                            <description>Selects Master or Slave mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SOD</name>
                            <description>Slave-mode output disable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RESTxFIFO</name>
                            <description>Program reset of the TX FIFO</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DR</name>
                    <displayName>DR</displayName>
                    <description>Data register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Data for transmission or receipt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SR</name>
                    <displayName>SR</displayName>
                    <description>Status register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>TFE</name>
                            <description>Transmit FIFO empty</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TNF</name>
                            <description>Transmit FIFO not full</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNE</name>
                            <description>Receive FIFO not empty</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RFF</name>
                            <description>Receive FIFO full</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BSY</name>
                            <description>SSP busy flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CPSR</name>
                    <displayName>CPSR</displayName>
                    <description>Clock Prescaler Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DVSR</name>
                            <description>Clock divisor. Must be an even number from 2 to 254</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IMSC</name>
                    <displayName>IMSC</displayName>
                    <description>Interrupt mask set or clear register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RORIM</name>
                            <description>Receive overrun interrupt mask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTIM</name>
                            <description>Receive timeout interrupt mask</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXIM</name>
                            <description>Receive FIFO interrupt mask</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXIM</name>
                            <description>Transmit FIFO interrupt mask</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNEIM</name>
                            <description>Receive FIFO empty interrupt mask</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TFEIM</name>
                            <description>Tramsmit FIFO empty interrupt mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TNBSYIM</name>
                            <description>Transmitter shift register empty interrupt mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RIS</name>
                    <displayName>RIS</displayName>
                    <description>Raw interrupt status register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>RORRIS</name>
                            <description>The raw interrupt state (prior to masking) of the SSPRORINTR interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTRIS</name>
                            <description>The raw interrupt state (prior to masking) of the SSPRTINTR interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXRIS</name>
                            <description>The raw interrupt state (prior to masking) of the SSPRXINTR interrupt</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXRIS</name>
                            <description>The raw interrupt state (prior to masking) of the SSPTXINTR interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNERIS</name>
                            <description>The raw interrupt state (prior to masking) of the SSPRNEINTR interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TFERIS</name>
                            <description>The raw interrupt state (prior to masking) of the SSPTFEINTR interrupt</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TNBSYRIS</name>
                            <description>The raw interrupt state (prior to masking) of the SSPTNBSYINTR interrupt</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MIS</name>
                    <displayName>MIS</displayName>
                    <description>Masked interrupt status register</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>RORMIS</name>
                            <description>Masked interrupt status of the SSPRORINTR</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTMIS</name>
                            <description>Masked interrupt status of the SSPRTINTR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXMIS</name>
                            <description>Masked interrupt status of the SSPRXINTR</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXMIS</name>
                            <description>Masked interrupt status of the SSPTXINTR</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNEMIS</name>
                            <description>Masked interrupt status of the SSPRNEINTR</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TFEMIS</name>
                            <description>Masked interrupt status of the SSPTFEINTR</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TNBSYMIS</name>
                            <description>Masked interrupt status of the SSPTNBSYINTR</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ICR</name>
                    <displayName>ICR</displayName>
                    <description>Interrupt clear register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <fields>
                        <field>
                            <name>RORIC</name>
                            <description>Clears the SSPRORINTR interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RTIC</name>
                            <description>Clears the SSPRTINTR interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMACR</name>
                    <displayName>DMACR</displayName>
                    <description>DMACR description</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>RXDMAE</name>
                            <description>If RXDMAE=1, DMA for the transmit FIFO is enabled</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXDMAE</name>
                            <description>If TXDMAE=1, DMA for the transmit FIFO is enabled</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
