alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>DMA</name>
            <description>DMA Controller</description>
            <groupName>DMA</groupName>
            <baseAddress>0x50028000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DMA_IRQ</name>
                <value>0</value>
            </interrupt>
            <registers>
                <register>
                    <name>STATUS</name>
                    <displayName>STATUS</displayName>
                    <description>STATUS Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>TEST_STATUS</name>
                            <description>Defines if there is an in-built testing system</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_TESTING_SYSTEM</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>TESTING_SYSTEM</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CHNLS_MINUS1</name>
                            <description>The number of available DMA channels minus one</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>STATE</name>
                            <description>A current state of the DMA Controller</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>idle</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>reading channel control data</name>
                                    <value>1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>reading source data end pointer</name>
                                    <value>2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>reading destination data end pointer</name>
                                    <value>3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>reading source data</name>
                                    <value>4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>writing destination data</name>
                                    <value>5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>waiting for DMA request to clear</name>
                                    <value>6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>writing channel controller data</name>
                                    <value>7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>stalled</name>
                                    <value>8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>done</name>
                                    <value>9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>peripheral scatter-gather transition</name>
                                    <value>10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>undefined</name>
                                    <value>11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MASTER_ENABLE</name>
                            <description>Enables the status of the controller</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>The controller is disabled</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>The controller is enabled</name>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CFG</name>
                    <displayName>CFG</displayName>
                    <description>DMA Configuration Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CHNL_PROT_CTRL</name>
                            <description>Sets the AHB-Lite protection by controlling the HPROT[3:1] signal levels</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>MASTER_ENABLE</name>
                            <description>Enables the DMA controller</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Disables DMA</name>
                                    <value>0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Enables DMA</name>
                                    <value>1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL_BASE_PTR</name>
                    <displayName>CTRL_BASE_PTR</displayName>
                    <description>Channel control data base pointer</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                </register>
                <register>
                    <name>ALT_CTRL_BASE_PTR</name>
                    <displayName>ALT_CTRL_BASE_PTR</displayName>
                    <description>Channel alternate control data base pointer</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>WAITONREQ_STATUS</name>
                    <displayName>WAITONREQ_STATUS</displayName>
                    <description>Channel wait on request status</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                       <field>
                            <name>CHANNEL_0</name>
                            <description>CHANNEL_0: UART1 TX</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_1</name>
                            <description>CHANNEL_1: UART1 RX</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_2</name>
                            <description>CHANNEL_2: UART2 TX</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_3</name>
                            <description>CHANNEL_3: UART2 RX</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_4</name>
                            <description>CHANNEL_4: SSP1 TX</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_5</name>
                            <description>CHANNEL_5: SSP1 RX</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_6</name>
                            <description>CHANNEL_6: CRC</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_7</name>
                            <description>CHANNEL_7: UART3 TX</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_8</name>
                            <description>CHANNEL_8: UART3 RX</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_9</name>
                            <description>CHANNEL_9: TIMER3</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_10</name>
                            <description>CHANNEL_10: TIMER1</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_11</name>
                            <description>CHANNEL_11: TIMER2</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_12</name>
                            <description>CHANNEL_12: ADCUI1</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_13</name>
                            <description>CHANNEL_13: ADCUI2</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_14</name>
                            <description>CHANNEL_14: ADCUI3</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_15</name>
                            <description>CHANNEL_15: ADCUI4</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_16</name>
                            <description>CHANNEL_16: ADCUI5</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_17</name>
                            <description>CHANNEL_17: ADCUI6</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_18</name>
                            <description>CHANNEL_18: ADCUI7</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_19</name>
                            <description>CHANNEL_19: SSP2 TX</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_20</name>
                            <description>CHANNEL_20: SSP2 RX</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_21</name>
                            <description>CHANNEL_21: SSP3 TX</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_22</name>
                            <description>CHANNEL_22: SSP3 RX</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_23</name>
                            <description>CHANNEL_23: TIMER4</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_24</name>
                            <description>CHANNEL_24: UART4 TX</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_25</name>
                            <description>CHANNEL_25: UART4 RX</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_26</name>
                            <description>CHANNEL_26</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_27</name>
                            <description>CHANNEL_27</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_28</name>
                            <description>CHANNEL_28</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_29</name>
                            <description>CHANNEL_26</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_30</name>
                            <description>CHANNEL_30: SAR ADC</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_31</name>
                            <description>CHANNEL_31</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
