alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
                <register derivedFrom="WAITONREQ_STATUS">
                    <name>CHNL_SW_REQUEST</name>
                    <displayName>CHNL_SW_REQUEST</displayName>
                    <description>Channel software request. Set the appropriate bit to generate a software DMA request on the corresponding DMA channel</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                </register>
                <register>
                    <name>CHNL_USEBURST_SET</name>
                    <displayName>CHNL_USEBURST_SET</displayName>
                    <description>Channel useburst set. Returns the useburst status, or disables dma_sreq[C] from generating DMA requests.</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CHANNEL_0</name>
                            <description>CHANNEL_0: UART1 TX</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_1</name>
                            <description>CHANNEL_1: UART1 RX</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_2</name>
                            <description>CHANNEL_2: UART2 TX</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_3</name>
                            <description>CHANNEL_3: UART2 RX</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_4</name>
                            <description>CHANNEL_4: SSP1 TX</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_5</name>
                            <description>CHANNEL_5: SSP1 RX</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_6</name>
                            <description>CHANNEL_5: CRC</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_7</name>
                            <description>CHANNEL_7: UART3 TX</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_8</name>
                            <description>CHANNEL_8: UART3 RX</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                        <name>CHANNEL_9</name>
                            <description>CHANNEL_9: TIMER3</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_10</name>
                            <description>CHANNEL_10: TIMER1</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_11</name>
                            <description>CHANNEL_11: TIMER2</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_12</name>
                            <description>CHANNEL_12: ADCUI1</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_13</name>
                            <description>CHANNEL_13: ADCUI2</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_14</name>
                            <description>CHANNEL_14: ADCUI3</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_15</name>
                            <description>CHANNEL_15: ADCUI4</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_16</name>
                            <description>CHANNEL_16: ADCUI5</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_17</name>
                            <description>CHANNEL_17: ADCUI6</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_18</name>
                            <description>CHANNEL_18: ADCUI7</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_19</name>
                            <description>CHANNEL_19: SSP2 TX</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_20</name>
                            <description>CHANNEL_20: SSP2 RX</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_21</name>
                            <description>CHANNEL_21: SSP3 TX</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_22</name>
                            <description>CHANNEL_22: SSP3 RX</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_23</name>
                            <description>CHANNEL_23: TIMER4</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_24</name>
                            <description>CHANNEL_24: UART4 TX</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_25</name>
                            <description>CHANNEL_25: UART4 RX</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_26</name>
                            <description>CHANNEL_26</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_27</name>
                            <description>CHANNEL_27</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_28</name>
                            <description>CHANNEL_28</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_29</name>
                            <description>CHANNEL_29</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_30</name>
                            <description>CHANNEL_30: SAR ADC</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL_31</name>
                            <description>CHANNEL_31</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="CHNL_USEBURST_SET">
                    <name>CHNL_USEBURST_CLR</name>
                    <displayName>CHNL_USEBURST_CLR</displayName>
                    <description>Channel useburst clear. Set the appropriate bit to enable dma_sreq[] to generate requests</description>
                    <addressOffset>0x0000001C</addressOffset>
                    <access>write-only</access>
                </register>
                <register derivedFrom="CHNL_USEBURST_SET">
                    <name>CHNL_REQ_MASK_SET</name>
                    <displayName>CHNL_REQ_MASK_SET</displayName>
                    <description>Channel request mask set. Returns the request mask status of dma_req[] and dma_sreq[], or disables the
corresponding channel from generating DMA requests</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                </register>
                <register derivedFrom="CHNL_USEBURST_SET">
                    <name>CHNL_REQ_MASK_CLR</name>
                    <displayName>CHNL_REQ_MASK_CLR</displayName>
                    <description>Channel request mask clear. Set the appropriate bit to enable DMA requests for the channel corresponding to
dma_req[] and dma_sreq[].</description>
                    <addressOffset>0x00000024</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                </register>
                <register derivedFrom="CHNL_USEBURST_SET">
                    <name>CHNL_ENABLE_SET</name>
                    <displayName>CHNL_ENABLE_SET</displayName>
                    <description>Channel enable set. Returns the enable status of the channels, or enables the corresponding channels</description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                </register>
                <register derivedFrom="CHNL_USEBURST_SET">
                    <name>CHNL_ENABLE_CLR</name>
                    <displayName>CHNL_ENABLE_CLR</displayName>
                    <description>Sets the appropriate bit to disable the corresponding DMA channel</description>
                    <addressOffset>0x0000002C</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                </register>
                <register derivedFrom="CHNL_USEBURST_SET">
                    <name>CHNL_PRI_ALT_SET</name>
                    <displayName>CHNL_PRI_ALT_SET</displayName>
                    <description>Channel primary-alternate set register enables you to configure a DMA channel to use the alternate data structure or returns the channel control data structure status.</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                </register>
                <register derivedFrom="CHNL_USEBURST_SET">
                    <name>CHNL_PRI_ALT_CLR</name>
                    <displayName>CHNL_PRI_ALT_CLR</displayName>
                    <description>Channel primary-alternate clear register enables you to configure a DMA channel to use the primary data structure</description>
                    <addressOffset>0x00000034</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                </register>
                <register derivedFrom="CHNL_USEBURST_SET">
                    <name>CHNL_PRIORITY_SET</name>
                    <displayName>CHNL_PRIORITY_SET</displayName>
                    <description>Channel priority set enables you to configure a DMA channel to use the high priority level. Reading the register returns the status of the channel priority mask.</description>
                    <addressOffset>0x00000038</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                </register>
                <register derivedFrom="CHNL_USEBURST_SET">
                    <name>CHNL_PRIORITY_CLR</name>
                    <displayName>CHNL_PRIORITY_CLR</displayName>
                    <description>Channel priority clear register enables you to configure a DMA channel to use the default priority level</description>
                    <addressOffset>0x0000003C</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                </register>
                <register>
                    <name>ERR_CLR</name>
                    <displayName>ERR_CLR</displayName>
                    <description>Error clear register enables you to set dma_err LOW</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>ERR_CLR</name>
                            <description>Returns the status of dma_err, or sets the signal LOW</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
