alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>ADC</name>
            <description>ADC Controller</description>
            <groupName>ADC</groupName>
            <baseAddress>0x50040000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ADC_IRQ</name>
                <value>8</value>
            </interrupt>
            <registers>
                <register>
                    <name>ADC1_CFG</name>
                    <displayName>ADC1_CFG</displayName>
                    <description>ADC1 Configuration Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>Cfg_REG_ADON</name>
                            <description>Turns on the ADC1 controller</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Cfg_REG_GO</name>
                            <description>Starts the conversion</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Cfg_REG_CLKS</name>
                            <description>Selects ADC clock source</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>ACLK</name>
                                    <description>Selects ACLK as the clock source</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>PCLKd</name>
                                    <description>Selects PCLKd as the clock source</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Cfg_REG_SAMPLE</name>
                            <description>Selects ADC working mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Single</name>
                                    <description>Selects single working mode</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Sequential</name>
                                    <description>Selects sequential working mode</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Cfg_REG_CHS</name>
                            <description>Selects the analogue channel for conversion</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>CH0_ThermoS</name>
                                    <description>CHANNEL_0: Thermosensor</description>
                                    <value>0x7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CH1_SAR_AIN1</name>
                                    <description>CHANNEL_1: SAR_AIN1</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CH2_SAR_AIN2</name>
                                    <description>CHANNEL_2: SAR_AIN2</description>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CH3_SAR_AIN3</name>
                                    <description>CHANNEL_3: SAR_AIN3</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CH4_TestMode</name>
                                    <description>CHANNEL_4: TestMode</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CH5_VDD_BD</name>
                                    <description>CHANNEL_5: VDD_BD</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CH6_VREF</name>
                                    <description>CHANNEL_6: VREF</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>CH7_TestMode</name>
                                    <description>CHANNEL_7: TestMode</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Cfg_REG_CHCH</name>
                            <description>Selects switching of the channels</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        <enumeratedValues>
                            <enumeratedValue>
                                    <name>ON</name>
                                    <description>Channels switching is ON</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>OFF</name>
                                    <description>Only the selected channel is being used</description>
                                    <value>0x0</value>
                            </enumeratedValue>
                        </enumeratedValues>
                        </field>
                        <field>
                            <name>Cfg_REG_RNGC</name>
                            <description>Allows the automatic control of overrunning</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Cfg_M_REF</name>
                            <description>Selects the ADC range</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        <enumeratedValues>
                                <enumeratedValue>
                                    <name>SCALE_VREF</name>
                                    <description>ADC scale from 0 to VREF voltage</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SCALE_UCCA</name>
                                    <description>ADC scale from 0 to UCCA voltage</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>Cfg_REG_DIVCLK</name>
                            <description>Selects the divisor of PCLK</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>Delay_Go</name>
                            <description>Selects a delay value before the next conversion</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_H_LEVEL</name>
                    <displayName>ADC1_H_LEVEL</displayName>
                    <description>ADC1 Higher Level Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>REG_H_LEVEL</name>
                            <description>ADC1 higher level</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_L_LEVEL</name>
                    <displayName>ADC1_L_LEVEL</displayName>
                    <description>ADC1 Lower Level Register</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>REG_L_LEVEL</name>
                            <description>ADC1 lower level</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_RESULT</name>
                    <displayName>ADC1_RESULT</displayName>
                    <description>ADC1 RESULT Register</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>RESULT</name>
                            <description>Conversion result</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>CHANNEL</name>
                            <description>Selects the channel to display the result</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        <enumeratedValues>
                            <enumeratedValue>
                                    <name>VREF_R</name>
                                    <description>From 0 to VREF</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>UCCA_R</name>
                                    <description>From 0 to UCCA</description>
                                    <value>0x0</value>
                            </enumeratedValue>
                        </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_STATUS</name>
                    <displayName>ADC1_STATUS</displayName>
                    <description>ADC1 Status Register</description>
                    <addressOffset>0x00000020</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>Flg_REG_OVERWRITE</name>
                            <description>Signals if the result has been overwritten in ADC1_RESULT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Flg_REG_AWOIFEN</name>
                            <description>Signals if the result is out of the boundaries</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Flg_REG_EOCIF</name>
                            <description>Signals if there's a result of the conversion</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>AWOIF_IE</name>
                            <description>Indicates if an interrupt triggered by Flg_REG_AWOIFEN is allowed</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ECOIF_IE</name>
                            <description>Indicates if an interrupt triggered by Flg_REG_ECOIF is allowed</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC1_CHSEL</name>
                    <displayName>Write "1" defines the channels for automatic consequetive conversion.</displayName>
                    <description></description>
                    <addressOffset>0x00000028</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>Sl_Ch_Ch_REF0</name>
                            <description>CHANNEL_0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Sl_Ch_Ch_REF1</name>
                            <description>CHANNEL_1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Sl_Ch_Ch_REF2</name>
                            <description>CHANNEL_2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Sl_Ch_Ch_REF3</name>
                            <description>CHANNEL_3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Sl_Ch_Ch_REF4</name>
                            <description>CHANNEL_4</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Sl_Ch_Ch_REF5</name>
                            <description>CHANNEL_5</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Sl_Ch_Ch_REF6</name>
                            <description>CHANNEL_6</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>Sl_Ch_Ch_REF7</name>
                            <description>CHANNEL_7</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADC_TRIM</name>
                    <displayName>ADC_TRIM</displayName>
                    <description>Reference voltage source configuration</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BG_TRIM</name>
                            <description>Bandgap adjustment</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
