alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
                <register derivedFrom="RTC_DR">
                    <name>RTC_TSDR1</name>
                    <displayName>RTC_TSDR1</displayName>
                    <description>Data of an external Intrusion</description>
                    <addressOffset>0x00000040</addressOffset>
                    <access>read-only</access>
                </register>
                <register derivedFrom="RTC_DR">
                    <name>RTC_TSDR2</name>
                    <displayName>RTC_TSDR2</displayName>
                    <description>Data of an external Intrusion</description>
                    <addressOffset>0x00000044</addressOffset>
                    <access>read-only</access>
                </register>
                <register derivedFrom="RTC_DR">
                    <name>RTC_TSDR3</name>
                    <displayName>RTC_TSDR3</displayName>
                    <description>Data of an external Intrusion</description>
                    <addressOffset>0x00000048</addressOffset>
                    <access>read-only</access>
                </register>
                <register>
                    <name>RTC_TAFCR</name>
                    <displayName>RTC_TAFCR</displayName>
                    <description>Control Register for an Intrusion Fixation</description>
                    <addressOffset>0x0000004C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>TAMP_EN</name>
                            <description>Detection of Tamper event for WAKEUP1 - WAKEUP3 inputs</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_TRG_0</name>
                            <description>Active trigger of Tamper event for WAKEUP1</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POSED_HIGHLEV</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEGED_LOWLEV</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TAMP_TRG_1</name>
                            <description>Active trigger of Tamper event for WAKEUP2</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POSED_HIGHLEV</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEGED_LOWLEV</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TAMP_TRG_2</name>
                            <description>Active trigger of Tamper event for WAKEUP3</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>POSED_HIGHLEV</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>NEGED_LOWLEV</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TAMP_IE</name>
                            <description>Enables Tamper interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_EN</name>
                            <description>Enables time storing when TIMESTAMP is fixed</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_EDGE_0</name>
                            <description>Sets the operating edge for TIMESTAMP at WAKEUP1</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RE_HIGHLEV</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FE_LOWLEV</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TS_EDGE_1</name>
                            <description>Sets the operating edge for TIMESTAMP at WAKEUP2</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RE_HIGHLEV</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FE_LOWLEV</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TS_EDGE_2</name>
                            <description>Sets the operating edge for TIMESTAMP at WAKEUP3</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>RE_HIGHLEV</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FE_LOWLEV</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TS_IE</name>
                            <description>Enables interrupt when TIMESTAMP is fixed</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_IN_SEL_0</name>
                            <description>Signals if an external event for WAKEUP1 has been detected by TAMPER</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_IN_SEL_1</name>
                            <description>Signals if an external event for WAKEUP2 has been detected by TAMPER</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_IN_SEL_2</name>
                            <description>Signals if an external event for WAKEUP3 has been detected by TAMPER</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_IN_SEL_0</name>
                            <description>Signals if an external event for WAKEUP1 has been detected by TIMESTAMP</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_IN_SEL_1</name>
                            <description>Signals if an external event for WAKEUP2 has been detected by TIMESTAMP</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TS_IN_SEL_2</name>
                            <description>Signals if an external event for WAKEUP3 has been detected by TIMESTAMP</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAKE_SLEEP</name>
                            <description>Selects switching on or off of the SW when WUTF=1</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>SW_OFF</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>SW_ON</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TAMP_EN_W_0</name>
                            <description>Individual enabling of TAMPER detection for WAKEUP1 when TAMP_EN = 0</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_EN_W_1</name>
                            <description>Individual enabling of TAMPER detection for WAKEUP2 when TAMP_EN = 0</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_EN_W_2</name>
                            <description>Individual enabling of TAMPER detection for WAKEUP3 when TAMP_EN = 0</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TAMP_EDGE_W_0</name>
                            <description>A rising edge fixation for WAKEUP1</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FIX_ON</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FIX_OFF</name>
                                    <description>An impulse with the width less than 2 cycles of RTC_CLOCK is not fixed.
                                                 The width greater than 2 cycles of RTC_CLOCK may be fixed
                                                 depending on TAMP_LEVEL_W</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TAMP_EDGE_W_1</name>
                            <description>A rising edge fixation for WAKEUP2</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FIX_ON</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FIX_OFF</name>
                                    <description>An impulse with the width less than 2 cycles of RTC_CLOCK is not fixed.
                                                 The width greater than 2 cycles of RTC_CLOCK may be fixed
                                                 depending on TAMP_LEVEL_W</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TAMP_EDGE_W_2</name>
                            <description>A rising edge fixation for WAKEUP3</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FIX_ON</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FIX_OFF</name>
                                    <description>An impulse with the width less than 2 cycles of RTC_CLOCK is not fixed.
                                                 The width greater than 2 cycles of RTC_CLOCK may be fixed
                                                 depending on TAMP_LEVEL_W</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TAMP_LEVEL_W_0</name>
                            <description>The level fixation for WAKEUP1</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FIX_ON</name>
                                    <description>Fixes the level with pulse width greater than 2 cycles of RTC_CLOCK</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FIX_OFF</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TAMP_LEVEL_W_1</name>
                            <description>The level fixation for WAKEUP2</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FIX_ON</name>
                                    <description>Fixes the level with pulse width greater than 2 cycles of RTC_CLOCK</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FIX_OFF</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TAMP_LEVEL_W_2</name>
                            <description>The level fixation for WAKEUP3</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>FIX_ON</name>
                                    <description>Fixes the level with pulse width greater than 2 cycles of RTC_CLOCK</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FIX_OFF</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_TMPCAL1</name>
                    <displayName>RTC_TMPCAL1</displayName>
                    <description>Calibration and Thermocompensation Unit Control Register 1</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CONST0</name>
                            <description>Calibration constant for code 0 of the thermosensor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST1</name>
                            <description>Calibration constant for code 1 of the thermosensor</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST2</name>
                            <description>Calibration constant for code 2 of the thermosensor</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST3</name>
                            <description>Calibration constant for code 3 of the thermosensor</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST4</name>
                            <description>Calibration constant for code 4 of the thermosensor</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST5</name>
                            <description>Calibration constant for code 5 of the thermosensor</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST6_LOW</name>
                            <description>Low-order bits of the calibration constant for code 6 of the thermosensor</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RTC_TMPCAL2</name>
                    <displayName>RTC_TMPCAL2</displayName>
                    <description>Calibration and Thermocompensation Unit Control Register 2</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CONST6_HIGH</name>
                            <description>High-order bits of the calibration constant for code 6 of the thermosensor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>CONST7</name>
                            <description>Calibration constant for code 7 of the thermosensor</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST8</name>
                            <description>Calibration constant for code 8 of the thermosensor</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST9</name>
                            <description>Calibration constant for code 9 of the thermosensor</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST10</name>
                            <description>Calibration constant for code 10 of the thermosensor</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST11</name>
                            <description>Calibration constant for code 11 of the thermosensor</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>CONST12_LOW</name>
                            <description>Low-order bits of the calibration constant for code 12 of the thermosensor</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
