alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
                <register>
                    <name>F1MD0</name>
                    <displayName>F1MD0</displayName>
                    <description>Parameters 0 for F1</description>
                    <addressOffset>0x00000088</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1PER_FREQ</name>
                            <description>Period length of the input signal in the V1-channel</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>21</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>V1GAIN</name>
                            <description>Digital gain in V1</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_GAIN</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>6dB</name>
                                    <description>Shifts the result by 1 to the left</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>I1GAIN</name>
                            <description>Digital gain in I1</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_GAIN</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>6dB</name>
                                    <description>Shifts the result by 1 to the left</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>F1REACTS</name>
                            <description>The sign of the reactive energy in the last period</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1ACTS</name>
                            <description>The sign of the active energy in the last period</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1ISEL</name>
                            <description>Data for the FIFO of the I1 channel</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>I_SAMPLES</name>
                                    <description>Before or after HPF. See F1ISEL_HPF</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE_POWER_SAMPLES</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REACTIVE_POWER_SAMPLES</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FULL_POWER_SAMPLES</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>F1VSEL</name>
                            <description>Data for the FIFO of the V1 channel</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>V_SAMPLES</name>
                                    <description>Before HPF</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>ACTIVE_POWER_SAMPLES</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REACTIVE_POWER_SAMPLES</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>V_HPF_SAMPLES</name>
                                    <description>After HPF</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1MD1</name>
                    <displayName>F1MD1</displayName>
                    <description>Parameters 1 for F1</description>
                    <addressOffset>0x0000008C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VPKLVL</name>
                            <description>V peak level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>F1IPKLVL</name>
                            <description>I peak level</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1MD2</name>
                    <displayName>F1MD2</displayName>
                    <description>Parameters 2 of F1</description>
                    <addressOffset>0x00000090</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1PHASE</name>
                            <description>Phase shift of V1 in regard to V0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>17</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VPEAK</name>
                    <displayName>F1VPEAK</displayName>
                    <description>V peak value in F1</description>
                    <addressOffset>0x00000094</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VPEAK</name>
                            <description>Voltage peak value. A "read" resets the value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1IPEAK</name>
                    <displayName>F1IPEAK</displayName>
                    <description>I peak value in F1</description>
                    <addressOffset>0x00000098</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1IPEAK</name>
                            <description>Current peak value. A "read" resets the value</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VDAT</name>
                    <displayName>F1VDAT</displayName>
                    <description>FIFO for V-channel samples in F1</description>
                    <addressOffset>0x0000009C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VDAT</name>
                            <description>V or a P samples FIFO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1IDAT</name>
                    <displayName>F1IDAT</displayName>
                    <description>I samples FIFO in F1</description>
                    <addressOffset>0x000000A0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1IDAT</name>
                            <description>I or a P samples FIFO</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VRMS</name>
                    <displayName>F1VRMS</displayName>
                    <description>V RMS in F1</description>
                    <addressOffset>0x000000A4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VRMS</name>
                            <description>V RMS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1VRMS2</name>
                    <displayName>F1VRMS2</displayName>
                    <description>V RMS squared in F1</description>
                    <addressOffset>0x000000A8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F1IRMS</name>
                    <displayName>F1IRMS</displayName>
                    <description>I RMS in F1</description>
                    <addressOffset>0x000000AC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1IRMS</name>
                            <description>I RMS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>24</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F1IRMS2</name>
                    <displayName>F1IRMS2</displayName>
                    <description>I RMS squared in F1</description>
                    <addressOffset>0x000000B0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F1STAT</name>
                    <displayName>F1STAT</displayName>
                    <description>F1 Status Register</description>
                    <addressOffset>0x000000B4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VAROVN</name>
                            <description>Overflow of the negative reactive energy accumulator register.
                             Write as "1" resets this flag</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1WATTOVN</name>
                            <description>Overflow of the negative active energy accumulator register. 
                             Write as "1" resets this flag</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1ZEROCRS</name>
                            <description>Zero-crossing in V-channel.
                             Write "1" resets this flag</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VANLDFL</name>
                            <description>Full power is less than the comparison level</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1VARNLDFL</name>
                            <description>Reactive power is less than the comparison level</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1VARSIGN</name>
                            <description>Reactive power has changed its sign.
                             Write as "1" resets this flag</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1APNLDFL</name>
                            <description>Active power is less than the comparison level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1APSIGN</name>
                            <description>Active power has changed its sign.
                             Write as "1" resets this flag</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1ZXTOF</name>
                            <description>No zero-crossing in V1 during ZXTOUT. 
                             Write as "1" resets this flag</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VAOV</name>
                            <description>Overflow of the full energy accumulator register.
                             Write as "1" resets this flag</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VAROVP</name>
                            <description>Overflow of the positive reactive energy accumulator register.
                             Write as "1" resets this flag</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1WATTOVP</name>
                            <description>Overflow of the positive active energy accumulator register.
                             Write as "1" resets this flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1PEAKIF</name>
                            <description>Excess of I threshold.
                             Write as "1" resets this flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1PEAKVF</name>
                            <description>Excess of V threshold.
                             Write as "1" resets this flag</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1SAGF</name>
                            <description>Voltage sag has occurred.
                             Write as "1" resets this flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1IF_OVR</name>
                            <description>Overflow of FIFO F1IDAT.
                             Write as "1" resets this flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1IF_FLL</name>
                            <description>FIFO F1DAT is full</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1IF_EMP</name>
                            <description>FIFO F1IDAT is empty</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1VF_OVR</name>
                            <description>Overflow of FIFO F1VDAT.
                             Write as "1" resets this flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VF_FLL</name>
                            <description>FIFO F1VDAT is full</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>F1VF_EMP</name>
                            <description>FIFO F1VDAT is empty</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
