alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
                <register>
                    <name>F1MASK</name>
                    <displayName>F1MASK</displayName>
                    <description>Mask for interrupts in F1</description>
                    <addressOffset>0x000000B8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F1VAROVNM</name>
                            <description>MASK: Overflow of the negative reactive energy accumulator</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1WATTOVNM</name>
                            <description>MASK: Overflow of the negative active energy accumulator</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1ZEROCRSM</name>
                            <description>MASK: Zero-crossing in V-channel</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VANLDFLM</name>
                            <description>MASK: Full power is less than the comparison level</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VARNLDFLM</name>
                            <description>MASK: Reactive power is less than the comparison level</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VARSIGNM</name>
                            <description>MASK: Reactive power has changed its sign</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1APNLDFLM</name>
                            <description>MASK: Active power is less than the comparison level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1APSIGNM</name>
                            <description>MASK: Active power has changed its sign</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1ZXTOFM</name>
                            <description>MASK: No zero-crossing in V1 during ZXTOUT</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VAOVM</name>
                            <description>MASK: Overflow of the full energy accumulator register</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VAROVPM</name>
                            <description>MASK: Overflow of the positive reactive energy accumulator register</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1WATTOVPM</name>
                            <description>MASK: Overflow of the positive active energy accumulator register</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1PEAKIFM</name>
                            <description>MASK: Excess of I threshold</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1PEAKVFM</name>
                            <description>MASK: Excess of V threshold</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1SAGFM</name>
                            <description>MASK: Voltage sag has occurred</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1IF_OVRM</name>
                            <description>MASK: Overflow of FIFO F1IDAT</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1IF_FLLM</name>
                            <description>MASK: FIFO F1DAT is full</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1IF_EMPM</name>
                            <description>MASK: FIFO F1IDAT is empty</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VF_OVRM</name>
                            <description>MASK: Overflow of FIFO F1IDAT</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VF_FLLM</name>
                            <description>MASK: FIFO F1VDAT is full</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>F1VF_EMPM</name>
                            <description>MASK: FIFO F1VDAT is empty</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2CTR</name>
                    <displayName>F2CTR</displayName>
                    <description>F2 Control Register</description>
                    <addressOffset>0x000000BC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2IRMSOS</name>
                            <description>Shift calibration for I2 RMS calculator</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>F2VPHASE_LOW</name>
                            <description>F2VPHASE low order bits</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>F2VPHASE_HIGH</name>
                            <description>Phase shift of V relative to I. In complementary code</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>F2VGAIN</name>
                            <description>Preamplifier in the V channel</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0dB</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>6dB</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>12dB</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>18dB</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>F2IGAIN</name>
                            <description>Preamplifier in the I channel</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>6dB</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>12dB</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>18dB</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>24dB</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>F2RVRS</name>
                            <description>A "write" in this register resets the counter of the transmitted full energy</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>F2RRRS</name>
                            <description>A "write" in this register resets the counter of the  transmitted reactive energy</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>F2RARS</name>
                            <description>A "write" in this register resets the counter of the transmitted active energy</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>F2VASEL</name>
                            <description>What to save in the Full Energy Register</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Full Energy</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>I RMS</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>F2INTEN</name>
                            <description>Disables the integrator in the I channel</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Int_ON</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Int_OFF</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2WC</name>
                    <displayName>F2WC</displayName>
                    <description>Active energy calculation in F2</description>
                    <addressOffset>0x000000C0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2WGAIN</name>
                            <description>Gain calibration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>F2WATTOS</name>
                            <description>Shift calibration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2WATTP</name>
                    <displayName>F2WATTP</displayName>
                    <description>Upper-part of the positive active energy accumulator in F2</description>
                    <addressOffset>0x000000C4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F2WATTN</name>
                    <displayName>F2WATTN</displayName>
                    <description>Upper-part of the negative active energy accumulator in F2</description>
                    <addressOffset>0x000000C8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F2VC</name>
                    <displayName>F2VC</displayName>
                    <description>Reactive energy calculation in F1</description>
                    <addressOffset>0x000000CC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VARGAIN</name>
                            <description>Gain calibration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>F2VAROS</name>
                            <description>Shift calibration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VARP</name>
                    <displayName>F2VARP</displayName>
                    <description>Upper-part of the positive reactive energy accumulator in F2</description>
                    <addressOffset>0x000000D0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F2VARN</name>
                    <displayName>F2VARN</displayName>
                    <description>Upper-part of the negative reactive energy accumulator in F1</description>
                    <addressOffset>0x000000D4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>F2AC</name>
                    <displayName>F2AC</displayName>
                    <description>Full energy calculation in F2</description>
                    <addressOffset>0x000000D8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>F2VAGAIN</name>
                            <description>Gain calibration</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>F2VRMSOS</name>
                            <description>VRMS calibration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>F2VR</name>
                    <displayName>F2VR</displayName>
                    <description>Upper-part of the full energy accumulator in F2</description>
                    <addressOffset>0x000000DC</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
