alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
                <register derivedFrom="CH1_CNTRL0">
                    <name>CH4_CNTRL0</name>
                    <displayName>CH4_CNTRL0</displayName>
                    <description>CH4 control register 0</description>
                    <addressOffset>0x0000002C</addressOffset>
                </register>
                <register>
                    <name>CH1_CNTRL1</name>
                    <displayName>CH1_CNTRL1</displayName>
                    <description>CH1 control register 1</description>
                    <addressOffset>0x00000030</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>SELOE</name>
                            <description>Selects the operating mode of the direct output of the channel CHyoe</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REF</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DTG</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SELO</name>
                            <description>Selects a source for the direct output of the channel CHyo</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>REF</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DTG</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>INV</name>
                            <description>Inversion of the direct output CHy</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NSELOE</name>
                            <description>Selects the operating mode of nCHyoe</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>nREF</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DTG</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NSELO</name>
                            <description>Selects a source for the inverted output of the channel nCHyo</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>LOW</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>HIGH</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>nREF</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DTG</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>NINV</name>
                            <description>Inversion of the inverted output nCHy</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="CH1_CNTRL1">
                    <name>CH2_CNTRL1</name>
                    <displayName>CH2_CNTRL1</displayName>
                    <description>CH2 control register 1</description>
                    <addressOffset>0x00000034</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL1">
                    <name>CH3_CNTRL1</name>
                    <displayName>CH3_CNTRL1</displayName>
                    <description>CH3 control register 1</description>
                    <addressOffset>0x00000038</addressOffset>
                </register>
                <register derivedFrom="CH1_CNTRL1">
                    <name>CH4_CNTRL1</name>
                    <displayName>CH4_CNTRL1</displayName>
                    <description>CH4 control register 1</description>
                    <addressOffset>0x0000003C</addressOffset>
                </register>
                <register>
                    <name>CH1_DTG</name>
                    <displayName>CH1_DTG</displayName>
                    <description>Dead-time register for channel 1</description>
                    <addressOffset>0x00000040</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DTGx</name>
                            <description>DTG clock prescaler</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>EDTS</name>
                            <description>DTG clock</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>TIM_CLK</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FDTS</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DTG</name>
                            <description>Main divisor for DTG. Delay DTGdel = DTG * (DTGx + 1)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="CH1_DTG">
                    <name>CH2_DTG</name>
                    <displayName>CH2_DTG</displayName>
                    <description>Dead-time register for channel 2</description>
                    <addressOffset>0x00000044</addressOffset>
                </register>
                <register derivedFrom="CH1_DTG">
                    <name>CH3_DTG</name>
                    <displayName>CH3_DTG</displayName>
                    <description>Dead-time register for channel 3</description>
                    <addressOffset>0x00000048</addressOffset>
                </register>
                <register derivedFrom="CH1_DTG">
                    <name>CH4_DTG</name>
                    <displayName>CH4_DTG</displayName>
                    <description>Dead-time register for channel 4</description>
                    <addressOffset>0x0000004C</addressOffset>
                </register>
                <register>
                    <name>BRKETR_CNTRL</name>
                    <displayName>BRKETR_CNTRL</displayName>
                    <description>BRK and ETR control register</description>
                    <addressOffset>0x00000050</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>BRK_INV</name>
                            <description>BRK inversion</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_INV</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INV</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ETR_INV</name>
                            <description>ETR inversion</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_INV</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>INV</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ETR_PSC</name>
                            <description>ETR frequency prescaler</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_DIV</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_2</name>
                                    <description>Division by 2</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_4</name>
                                    <description>Division by 4</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>DIV_8</name>
                                    <description>Division by 8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ETR_FLTR</name>
                            <description>ETR digital filter</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_FILTER</name>
                                    <description>FS = FDTS</description>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_1</name>
                                    <description>FS = TIM_CLK, N = 2</description>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_2</name>
                                    <description>FS = TIM_CLK, N = 4</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_3</name>
                                    <description>FS = TIM_CLK, N = 8</description>
                                    <value>0x3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_4</name>
                                    <description>FS = FDTS/2, N = 6</description>
                                    <value>0x4</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_5</name>
                                    <description>FS = FDTS/2, N = 8</description>
                                    <value>0x5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_6</name>
                                    <description>FS = FDTS/4, N = 6</description>
                                    <value>0x6</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_7</name>
                                    <description>FS = FDTS/4, N = 8</description>
                                    <value>0x7</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_8</name>
                                    <description>FS = FDTS/8, N = 6</description>
                                    <value>0x8</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_9</name>
                                    <description>FS = FDTS/8, N = 8</description>
                                    <value>0x9</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_10</name>
                                    <description>FS = FDTS/16, N = 5</description>
                                    <value>0xA</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_11</name>
                                    <description>FS = FDTS/16, N = 6</description>
                                    <value>0xB</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_12</name>
                                    <description>FS = FDTS/16, N = 8</description>
                                    <value>0xC</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_13</name>
                                    <description>FS = FDTS/32, N = 5</description>
                                    <value>0xD</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_14</name>
                                    <description>FS = FDTS/32, N = 6</description>
                                    <value>0xE</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>FILTER_15</name>
                                    <description>FS = FDTS/32, N = 8</description>
                                    <value>0xF</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
