alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
                <register>
                    <name>STATUS</name>
                    <displayName>STATUS</displayName>
                    <description>Timer status register</description>
                    <addressOffset>0x00000054</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CNT_ZERO_EVNT</name>
                            <description>CNT coincides with zero. Write as "0" resets the flag. 
                            A new event has a priority over a "write"</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_EVENT</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVENT_0</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CNT_ARR_EVNT</name>
                            <description>CNT coincides with ARR. Write as "0" resets the flag. 
                            A new event has a priority over a "write"</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_EVENT</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVENT_ARR</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ETR_RE_EVNT</name>
                            <description>A rising edge on the ETR. Write as "0" resets the flag.
                             A new event has a priority over a "write"</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_EVENT</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVENT_RE</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ETR_FE_EVNT</name>
                            <description>A falling edge on the ETR. Write as "0" resets the flag. 
                             A new event has a priority over a "write"</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_EVENT</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVENT_RE</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BRK_EVNT</name>
                            <description>The high level on the BRK. Write as "0" resets the flag if there is low level on the BRK</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>NO_EVENT</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>EVENT_HL</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_0</name>
                            <description>The counter value CNT is written in the CH1_CCR
                            when there is a selected edge on the CH1i</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_1</name>
                            <description>The counter value CNT is written in the CH2_CCR
                            when there is a selected edge on the CH2i</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_2</name>
                            <description>The counter value CNT is written in the CH3_CCR
                            when there is a selected edge on the CH3i</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_3</name>
                            <description>The counter value CNT is written in the CH4_CCR
                            when there is a selected edge on the CH4i</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_0</name>
                            <description>A rising edge on the output of the reference generator of channel 1</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_1</name>
                            <description>A rising edge on the output of the reference generator of channel 2</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_2</name>
                            <description>A rising edge on the output of the reference generator of channel 3</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_3</name>
                            <description>A rising edge on the output of the reference generator of channel 4</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_0</name>
                            <description>The counter value CNT is written in the CH1_CCR1
                            when there is a selected edge on the CH1i</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_1</name>
                            <description>The counter value CNT is written in the CH2_CCR1
                            when there is a selected edge on the CH2i</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_2</name>
                            <description>The counter value CNT is written in the CH3_CCR1
                            when there is a selected edge on the CH3i</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_3</name>
                            <description>The counter value CNT is written in the CH4_CCR1
                            when there is a selected edge on the CH4i</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>IE</name>
                    <displayName>IE</displayName>
                    <description>Interrupt enable register</description>
                    <addressOffset>0x00000058</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CNT_ZERO_EVNT_IE</name>
                            <description>Interrupt: CNT coincides with zero</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNT_ARR_EVNT_IE</name>
                            <description>Interrupt: CNT coincides with ARR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_RE_EVNT_IE</name>
                            <description>Interrupt: A rising edge on the ETR</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_FE_EVNT_IE</name>
                            <description>Interrupt: A falling edge on the ETR</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRK_EVNT_IE</name>
                            <description>Interrupt: The high level on the BRK</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_IE_0</name>
                            <description>Interrupt: The counter value CNT is written in the CH1_CCR
                            when there is a selected edge on the CH1i</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_IE_1</name>
                            <description>Interrupt: The counter value CNT is written in the CH2_CCR
                            when there is a selected edge on the CH2i</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_IE_2</name>
                            <description>Interrupt: The counter value CNT is written in the CH3_CCR
                            when there is a selected edge on the CH3i</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_IE_3</name>
                            <description>Interrupt: The counter value CNT is written in the CH4_CCR
                            when there is a selected edge on the CH4i</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        
                        <field>
                            <name>CCR_REF_EVNT_IE_0</name>
                            <description>Interrupt: A rising edge on the output of the reference generator of channel 1</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_IE_1</name>
                            <description>Interrupt: A rising edge on the output of the reference generator of channel 2</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_IE_2</name>
                            <description>Interrupt: A rising edge on the output of the reference generator of channel 3</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_IE_3</name>
                            <description>Interrupt: A rising edge on the output of the reference generator of channel 4</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_IE_0</name>
                            <description>Interrupt: The counter value CNT is written in the CH1_CCR1
                            when there is a selected edge on the CH1i</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_IE_1</name>
                            <description>Interrupt: The counter value CNT is written in the CH2_CCR1
                            when there is a selected edge on the CH2i</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_IE_2</name>
                            <description>Interrupt: The counter value CNT is written in the CH3_CCR1
                            when there is a selected edge on the CH3i</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_IE_3</name>
                            <description>Interrupt: The counter value CNT is written in the CH4_CCR1
                            when there is a selected edge on the CH4i</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DMA_RE</name>
                    <displayName>DMA_RE</displayName>
                    <description>The register enables the request for the DMA</description>
                    <addressOffset>0x0000005C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>CNT_ZERO_EVNT_RE</name>
                            <description>Enables the request when CNT coincides with zero</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNT_ARR_EVNT_RE</name>
                            <description>Enables the request when CNT coincides with ARR</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_RE_EVNT_RE</name>
                            <description>Enables the request when there is a rising edge on the ETR</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ETR_FE_EVNT_RE</name>
                            <description>Enables the request when there is a falling edge on the ETR</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BRK_EVNT_RE</name>
                            <description>Enables the request when there is the high level on the BRK</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_RE_0</name>
                            <description>Enables the request when the counter value CNT is written in the CH1_CCR
                            when there is a selected edge on the CH1i</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_RE_1</name>
                            <description>Enables the request when the counter value CNT is written in the CH2_CCR
                            when there is a selected edge on the CH2i</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_RE_2</name>
                            <description>Enables the request when the counter value CNT is written in the CH3_CCR
                            when there is a selected edge on the CH3i</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP_EVNT_RE_3</name>
                            <description>Enables the request when the counter value CNT is written in the CH4_CCR
                            when there is a selected edge on the CH4i</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_RE_0</name>
                            <description>Enables the request when there is a rising edge
                            on the output of the reference generator of channel 1</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_RE_1</name>
                            <description>Enables the request when there is a rising edge
                            on the output of the reference generator of channel 2</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_RE_2</name>
                            <description>Enables the request when there is a rising edge
                            on the output of the reference generator of channel 3</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_REF_EVNT_RE_3</name>
                            <description>Enables the request when there is a rising edge
                            on the output of the reference generator of channel 4</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_RE_0</name>
                            <description>Enables the request when the counter value CNT is written in the CH1_CCR1
                            when there is a selected edge on the CH1i</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_RE_1</name>
                            <description>Enables the request when the counter value CNT is written in the CH2_CCR1
                            when there is a selected edge on the CH2i</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_RE_2</name>
                            <description>Enables the request when the counter value CNT is written in the CH3_CCR1
                            when there is a selected edge on the CH3i</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCR_CAP1_EVNT_RE_3</name>
                            <description>Enables the request when the counter value CNT is written in the CH4_CCR1
                            when there is a selected edge on the CH4i</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
