alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="TIMER1">
            <name>TIMER2</name>
            <description>General purpose TIMER2</description>
            <groupName>TIMER2</groupName>
            <baseAddress>0x50078000</baseAddress>
            <interrupt>
                <name>TIMER2_IRQ</name>
                <value>7</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TIMER1">
            <name>TIMER3</name>
            <description>General purpose TIMER3</description>
            <groupName>TIMER3</groupName>
            <baseAddress>0x500D8000</baseAddress>
            <interrupt>
                <name>TIMER3_IRQ</name>
                <value>26</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="TIMER1">
            <name>TIMER4</name>
            <description>General purpose TIMER4</description>
            <groupName>TIMER4</groupName>
            <baseAddress>0x500E0000</baseAddress>
            <interrupt>
                <name>TIMER4_IRQ</name>
                <value>27</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>PORTA</name>
            <description>PORTA controller</description>
            <groupName>PORTA</groupName>
            <baseAddress>0x50080000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>EXT_INT1_IRQ</name>
                <value>11</value>
            </interrupt>
            <registers>
                <register>
                    <name>RXTX</name>
                    <displayName>RXTX</displayName>
                    <description>Direct access to the port data. When read a user gets the data of the receiver. ANALOG_EN=0:0, ANALOG_EN=1: output state. When write - the data are written in the output data register of the transmitter</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PIN0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN1</name>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN2</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN3</name>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN4</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN5</name>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN6</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN7</name>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN8</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN9</name>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN10</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN11</name>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN12</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN13</name>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN14</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PIN15</name>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="RXTX">
                    <name>OE</name>
                    <displayName>OE</displayName>
                    <description>Operating mode of the transmitter. 0 - Off. Analog mode, 1 - On. Digital mode</description>
                    <addressOffset>0x00000004</addressOffset>
                </register>
