alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
                <register>
                    <name>FUNC</name>
                    <displayName>FUNC</displayName>
                    <description>Function register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>PIN0</name>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>IO_Port</name>
                                <value>0x0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Main</name>
                                <value>0x1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Alternative</name>
                                <value>0x2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>Overridden</name>
                                <value>0x3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN1</name>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                         </field>
                        <field>
                            <name>PIN2</name>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN3</name>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN4</name>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN5</name>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN6</name>
                            <bitOffset>12</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN7</name>
                            <bitOffset>14</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN8</name>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN9</name>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN10</name>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN11</name>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN12</name>
                            <bitOffset>24</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN13</name>
                            <bitOffset>26</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN14</name>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PIN15</name>
                            <bitOffset>30</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>IO_Port</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Main</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Alternative</name>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Overridden</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register derivedFrom="RXTX">
                    <name>ANALOG</name>
                    <displayName>ANALOG</displayName>
                    <description>Operating mode of the receiver. 0 - Receiver is disabled. Analog mode,
                    1 - Receiver is enabled. Digital mode</description>
                    <addressOffset>0x0000000C</addressOffset>
                </register>
