alexapod/000_Milandr_Keil_pack_all/Миландр. Standard Peripherals Library/ExampleProjects/MDR32VF0xI/MDR1206/Eclipse/MDR1206FI_Template/svd/MDR1206AFI.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RANDOM</name>
            <description>Random Number Generator</description>
            <groupName>RANDOM</groupName>
            <baseAddress>0x500B8000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x00001000</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RANDOM_IRQ</name>
                <value>21</value>
            </interrupt>
            <registers>
                <register>
                    <name>STAT_CTRL_REG</name>
                    <displayName>STAT_CTRL_REG</displayName>
                    <description>Status and Control Register</description>
                    <addressOffset>0x00000000</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>EN_STATE</name>
                            <description>There is a least one group of enabled generators and the PAUSE is finished</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>The generator is busy gathering a random value</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>UNREAD_DATA</name>
                            <description>There are unread data</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>MASK_GEN0</name>
                            <description>Selects Gen0</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MASK_GEN1</name>
                            <description>Selects Gen1</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WORK_MODE</name>
                            <description>Gathering of a random number</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>Halt_Gathering</name>
                                    <value>0x0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Single</name>
                                    <value>0x1</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Start on Read</name>
                                    <description>when UNREAD_DATA=0</description>
                                    <value>0x2</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>Continuous</name>
                                    <value>0x3</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>BIT_CN</name>
                            <description>The counter of the bits which are left till the beginning of a new gathering</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>6</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INT_CTRL_REG</name>
                    <displayName>INT_CTRL_REG</displayName>
                    <description>Interrupt Control Register</description>
                    <addressOffset>0x00000004</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>INT_EN</name>
                            <description>Enables the interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UNREAD_DATA</name>
                            <description>There are unread data</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CLK_DIV_REG</name>
                    <displayName>CLK_DIV_REG</displayName>
                    <description>Clock Divider Register</description>
                    <addressOffset>0x00000008</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>DIV</name>
                            <description>RANDOM_CLK/(2*(DIV+1))</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PAUSE_REG</name>
                    <displayName>PAUSE_REG</displayName>
                    <description>Pause Register</description>
                    <addressOffset>0x0000000C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <fields/>
                </register>
                <register>
                    <name>OUTPUT_REG</name>
                    <displayName>OUTPUT_REG</displayName>
                    <description>The last random number</description>
                    <addressOffset>0x00000010</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>PAUSE_CNT_REG</name>
                    <displayName>PAUSE_CNT_REG</displayName>
                    <description>Pause Counter Register</description>
                    <addressOffset>0x00000014</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
                <register>
                    <name>TEMP_REG</name>
                    <displayName>TEMP_REG</displayName>
                    <description>The current value of the shift register for a random number</description>
                    <addressOffset>0x00000018</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <fields/>
                </register>
